Repository: gretalaurinaviciute/idea-platform
Catalog: core/locale/*/LC_MESSAGES/django.po
Languages: lt

source: skilled specialist
lt: įgudęs specialistas

source: idea proposer
lt: idėjų siūlytojas

source: i am a
lt: aš esu

source: skill 1
lt: įgūdis 1

source: skill 2
lt: įgūdis 2

source: skill 3
lt: įgūdis 3

source: category
lt: kategorija

source: less than 1 year
lt: mažiau nei 1 metai

source: 1-3 years
lt: 1-3 metai

source: 3-5 years
lt: 3-5 metai

source: more than 5 years
lt: daugiau nei 5 metai

source: years of experience
lt: patirtis

source: I agree to the <a href="/terms/" target="_blank">Platform Terms of Use & Community Guidelines</a>.
lt: Sutinku su <a href="/terms/" target="_blank">platformos naudojimo sąlygomis ir bendruomenės gairėmis</a>.

source: You must agree to the platform rules to register.
lt: Turite sutikti su platformos taisyklėmis, kad užsiregistruotumėte.

source: At least one skill is required
lt: Būtina įvesti bent vieną įgūdį

source: Select a category
lt: Pasirinkite kategoriją

source: Suggest a new category
lt: Pasiūlykite naują kategoriją

source: You must select a category or suggest a new one.
lt: Būtina pasirinkti kategoriją arba pasiūlyti naują.

source: old password
lt: senas slaptažodis

source: new password
lt: naujas slaptažodis

source: your password must be at least 8 characters, cannot be commonly used, and cannot be fully numeric.
lt: slaptažodį turi sudaryti bent 8 simboliai, negali būti dažnai naudojamas ir visiškai skaitinis.

source: new password confirmation
lt: naujo slaptažodžio patvirtinimas

source: enter the same password as before for verification.
lt: patvirtinimui įveskite tą patį slaptažodį, kaip ir anksčiau.

source: leave an optional comment...
lt: palikite komentarą...

source: Approved
lt: Patvirtinta

source: Pending
lt: Laukiama patvirtinimo

source: administrator
lt: administratorius

source: user type
lt: vartotojo tipas

source: description
lt: aprašymas

source: skills
lt: įgūdžiai

source: experience
lt: patirtis

source: agreed to terms at
lt: sutiko su sąlygomis

source: title
lt: pavadinimas

source: created at
lt: sukurta

source: file
lt: failai

source: image
lt: vaizdas

source: uploaded at
lt: įkelta

source: saved idea
lt: išsaugota idėja

source: saved ideas
lt: išsaugotos idėjos

source: comment
lt: komentaras

source: review
lt: atsiliepimas

source: reviews
lt: atsiliepimai

source: sender
lt: siuntėjas

source: receiver
lt: gavėjas

source: message body
lt: žinutės tekstas

source: timestamp
lt: laiko žyma

source: is read
lt: perskaityta

source: message
lt: žinutė

source: messages
lt: žinutės

source: welcome
lt: labas

source: logout
lt: atsijungti

source: login
lt: prisijungti

source: register
lt: užsiregistruoti

source: menu
lt: meniu

source: my profile
lt: mano profilis

source: search
lt: paieška

source: my ideas
lt: mano idėjos

source: inbox
lt: pašto dėžutė

source: chat with
lt: pokalbis su

source: write a message...
lt: rašykite žinutę...

source: send
lt: siųsti

source: conversations
lt: pokalbiai

source: no messages yet
lt: nėra jokių pokalbių

source: incorrect username or password. please try again.
lt: neteisingas vartotojo vardas ar slaptažodis. bandykite iš naujo.

source: username
lt: vartotojo vardas

source: password
lt: slaptažodis

source: don't have an account?
lt: neturite paskyros?

source: sign up
lt: užsiregistruokite

source: post a new idea
lt: skelbti idėją

source: no
lt: ne

source: files
lt: failai

source: posted on
lt: paskelbta

source: actions
lt: veiksmai

source: (Pending Approval)
lt: (laukiam patvirtinimo)

source: download
lt: atsisiųsti

source: no files
lt: nėra failų

source: edit
lt: redaguoti

source: Are you sure you want to delete this idea?
lt: Ar tikrai norite ištrinti šią idėją?

source: delete
lt: ištrinti

source: you haven't posted any ideas yet.
lt: neturite jokių paskelbtų idėjų.

source: edit your idea
lt: redaguoti idėją

source: can't find a suitable category?
lt: nerandate tinkamos kategorijos?

source: suggest a new category
lt: pasiūlykite naują kategoriją

source: existing files
lt: esami failai

source: remove
lt: ištrinti

source: upload files
lt: įkelti failus

source: allowed file types: .pdf, .docx, .txt, .png, .jpg, .jpeg | max size: 5MB
lt: priimami failų tipai: .pdf, .docx, .txt, .png, .jpg, .jpeg | max dydis: 5MB

source: update
lt: atnaujinti

source: submit
lt: pateikti

source: about me
lt: apie mane

source: category of interest
lt: kategorija

source: e.g., Python, UI/UX, Marketing
lt: pvz., Python, UI/UX, marketingas

source: separate skills with commas (e.g., Python, Django, SQL)
lt: atskirkite įgūdžius kableliais (pvz., Python, Django, SQL)

source: save changes
lt: išsaugoti

source: change password
lt: keisti slaptažodį

source: Portfolio image
lt: Portfolio vaizdas

source: no images uploaded
lt: nėra jokių vaizdų

source: no portfolio items yet.
lt: nėra portfolio

source: upload image (supported image extensions: jpg, jpeg, png)
lt: įkelti vaizdus (priimtini plėtiniai: jpg, jpeg, png)

source: upload
lt: įkelti

source: my reviews
lt: mano atsiliepimai

source: average rating:
lt: vidutinis įvertinimas:

source: no ratings yet.
lt: jokių atsiliepimų.

source: i am a:
lt: aš esu

source: password must contain:\n- at least 8 characters\n- not too similar to your personal info\n- not a commonly used password\n- not entirely numeric
lt: slaptažodyje turi būti:\n- bent 8 simboliai\n- neturi būti pernelyg panašus į asmeninę informaciją\n- neturi būti dažnai naudojamas slaptažodis\n- negali būti tik skaičiai

source: confirm password
lt: patvirtinkite slaptažodį

source: at least one skill is required
lt: bent vienas įgūdis yra privalomas

source: I agree to the
lt: sutinku su

source: platform terms of use & community guidelines
lt: platformos naudojimo taisyklėmis ir bendruomenės gairėmis

source: already have an account?
lt: jau turite paskyrą?

source: view
lt: peržiūrėti

source: you haven't saved any ideas yet.
lt: dar nesate išsaugoję idėjų.

source: search...
lt: ieškoti...

source: all categories
lt: visos kategorijos

source: skill (e.g. Python)
lt: įgūdis (pvz. Python)

source: ideas
lt: idėjos

source: no ideas found.
lt: idėjų nerasta.

source: specialists
lt: specialistai

source: idea proposers
lt: idėjų siūlytojai

source: no specialists found.
lt: specialistų nerasta.

source: no idea proposers found.
lt: idėjų siūlytojų nerasta.

source: Platform terms of use & community guidelines
lt: Platformos naudojimo taisyklės ir bendruomenės gairės

source: Welcome to idea ⇄ platform! By registering and using this platform, you agree to abide by the following:
lt: Sveiki atvykę į idea ⇄ platform! Registruodamiesi ir naudodamiesi šia platforma, jūs sutinkate laikytis šių taisyklių:

source: Main guidelines (for all users)
lt: Pagrindinės gairės (visiems vartotojams)

source: Respect all members of the platform
lt: Gerbkite visus platformos narius

source: Do not steal, copy, or misuse any idea you see
lt: Nevokite, nekopijuokite ir nepiktnaudžiaukite kitų idėjomis

source: Use clear and constructive communication
lt: Naudokite aiškią ir konstruktyvią komunikaciją

source: Do not post harmful, offensive, or misleading content
lt: Neskleiskite žalingo, įžeidžiančio ar klaidinančio turinio

source: For idea proposers
lt: Idėjų siūlytojams

source: Be clear and detailed about your ideas
lt: Aiškiai ir išsamiai aprašykite savo idėjas

source: Understand that feedback is voluntary and collaborative
lt: Supraskite, kad grįžtamasis ryšys yra savanoriškas ir bendradarbiavimo pagrindu

source: Be open to suggestions and improvements
lt: Būkite atviri pasiūlymams ir patobulinimams

source: For specialists
lt: Specialistams

source: Respect intellectual property — do not reuse ideas without permission
lt: Gerbkite intelektinę nuosavybę – nenaudokite idėjų be leidimo

source: Provide thoughtful and honest input where possible
lt: Teikite apgalvotus ir sąžiningus atsiliepimus, kai tai įmanoma

source: Only accept work or collaboration if you're confident in your ability to contribute
lt: Sutikite dirbti ar bendradarbiauti tik tada, jei esate tikri dėl savo gebėjimų prisidėti

source: By creating an account and using the platform, you agree to all of the above.
lt: Sukūrę paskyrą ir naudodamiesi platforma, sutinkate su visomis aukščiau pateiktomis taisyklėmis

source: unsave
lt: pašalinti iš išsaugotų

source: save
lt: išsaugoti

source: no category
lt: nėra kategorijos

source: posted by
lt: paskelbė

source: attached files
lt: pridėti failai

source: no files attached.
lt: failų nepridėta.

source: back to search
lt: atgal į paiešką

source: category of expertise
lt: specializacijos sritis

source: idea category
lt: idėjos kategorija

source: not specified
lt: nenurodyta

source: average rating
lt: vidutinis įvertinimas

source: posted ideas
lt: paskelbtos idėjos

source: no ideas posted yet.
lt: dar neįkelta jokių idėjų.

source: portfolio gallery
lt: portfolio galerija

source: portfolio image
lt: portfolio vaizdas

source: no portfolio uploaded.
lt: portfolio nėra.

source: leave a review
lt: palikite atsiliepimą

source: rating
lt: įvertinimas

source: comment (optional)
lt: komentaras (nebūtina)

source: share your thoughts...
lt: pasidalinkite mintimis...

source: submit review
lt: pateikti atsiliepimą

source: no reviews yet.
lt: atsiliepimų kol kas nėra.

source: 1–3 years
lt: 1–3 metai

source: 3–5 years
lt: 3–5 metai

source: N/A
lt: Nenurodyta

source: Password updated successfully!
lt: Slaptažodis sėkmingai atnaujintas!

source: Please correct the error above.
lt: Prašome ištaisyti klaidą aukščiau.

source: Image uploaded!
lt: Nuotrauka įkelta!

source: New category '%(name)s' created and marked as PENDING.
lt: Sukurta nauja kategorija '%(name)s' ir pažymėta kaip LAUKIAMA.

source: Your idea has been saved, but the category is pending approval.
lt: Jūsų idėja išsaugota, tačiau kategorija laukia patvirtinimo.

source: File type %(ext)s is not allowed.
lt: Failo tipas %(ext)s neleidžiamas.

source: %(file)s exceeds the 5MB limit.
lt: Failas %(file)s viršija 5MB ribą.

source: ❌ %(file)s has unsupported MIME type (%(mime)s) for extension %(ext)s.
lt: ❌ Failo %(file)s MIME tipas (%(mime)s) neatitinka plėtinio %(ext)s.

source: Idea updated successfully!
lt: Idėja sėkmingai atnaujinta!

source: Idea deleted successfully!
lt: Idėja sėkmingai ištrinta!

source: your review has been submitted!
lt: atsiliepimas pateiktas!
